[{"model": "django_plotly_dash.statelessapp", "pk": 1, "fields": {"app_name": "SimpleExample", "slug": "simpleexample"}}, {"model": "django_plotly_dash.statelessapp", "pk": 2, "fields": {"app_name": "plot-89438", "slug": "plot-89438"}}, {"model": "django_plotly_dash.statelessapp", "pk": 3, "fields": {"app_name": "plot-124944", "slug": "plot-124944"}}, {"model": "django_plotly_dash.statelessapp", "pk": 4, "fields": {"app_name": "plot-89439", "slug": "plot-89439"}}, {"model": "django_plotly_dash.statelessapp", "pk": 5, "fields": {"app_name": "plot-26838", "slug": "plot-26838"}}, {"model": "django_plotly_dash.statelessapp", "pk": 6, "fields": {"app_name": "plot-89877", "slug": "plot-89877"}}, {"model": "django_plotly_dash.statelessapp", "pk": 7, "fields": {"app_name": "simpleexamples", "slug": "simpleexamples"}}, {"model": "django_plotly_dash.statelessapp", "pk": 8, "fields": {"app_name": "Instrument_Run_Number", "slug": "instrument_run_number"}}, {"model": "autoreduce_webapp.cache", "pk": 2, "fields": {"created": "2019-02-26T16:35:49Z"}}, {"model": "autoreduce_webapp.cache", "pk": 12, "fields": {"created": "2019-03-26T13:31:57Z"}}, {"model": "autoreduce_webapp.cache", "pk": 13, "fields": {"created": "2019-03-26T13:32:09Z"}}, {"model": "autoreduce_webapp.cache", "pk": 14, "fields": {"created": "2019-03-26T13:42:31Z"}}, {"model": "autoreduce_webapp.cache", "pk": 15, "fields": {"created": "2019-03-26T13:42:50Z"}}, {"model": "autoreduce_webapp.cache", "pk": 16, "fields": {"created": "2019-03-26T14:09:09Z"}}, {"model": "autoreduce_webapp.cache", "pk": 17, "fields": {"created": "2019-03-26T14:27:01Z"}}, {"model": "autoreduce_webapp.cache", "pk": 19, "fields": {"created": "2019-03-26T16:45:19Z"}}, {"model": "autoreduce_webapp.cache", "pk": 20, "fields": {"created": "2019-05-03T10:21:53Z"}}, {"model": "autoreduce_webapp.cache", "pk": 21, "fields": {"created": "2019-05-03T11:46:08Z"}}, {"model": "autoreduce_webapp.cache", "pk": 22, "fields": {"created": "2019-05-03T12:14:51Z"}}, {"model": "autoreduce_webapp.cache", "pk": 23, "fields": {"created": "2019-06-03T10:45:51Z"}}, {"model": "autoreduce_webapp.cache", "pk": 24, "fields": {"created": "2019-10-29T15:44:21Z"}}, {"model": "autoreduce_webapp.cache", "pk": 26, "fields": {"created": "2019-11-13T14:47:45Z"}}, {"model": "autoreduce_webapp.cache", "pk": 27, "fields": {"created": "2020-03-02T15:52:47Z"}}, {"model": "autoreduce_webapp.cache", "pk": 30, "fields": {"created": "2020-03-23T17:56:54Z"}}, {"model": "autoreduce_webapp.cache", "pk": 36, "fields": {"created": "2020-03-25T08:09:28Z"}}, {"model": "autoreduce_webapp.cache", "pk": 41, "fields": {"created": "2020-04-24T10:45:44Z"}}, {"model": "autoreduce_webapp.cache", "pk": 44, "fields": {"created": "2020-05-13T08:28:52Z"}}, {"model": "autoreduce_webapp.cache", "pk": 45, "fields": {"created": "2020-05-18T17:05:37Z"}}, {"model": "autoreduce_webapp.cache", "pk": 46, "fields": {"created": "2020-05-18T17:07:48Z"}}, {"model": "autoreduce_webapp.cache", "pk": 47, "fields": {"created": "2020-07-09T13:24:39Z"}}, {"model": "autoreduce_webapp.cache", "pk": 48, "fields": {"created": "2020-07-09T13:26:13Z"}}, {"model": "autoreduce_webapp.cache", "pk": 50, "fields": {"created": "2020-07-20T10:43:29Z"}}, {"model": "autoreduce_webapp.cache", "pk": 53, "fields": {"created": "2020-08-04T09:11:43Z"}}, {"model": "autoreduce_webapp.usercache", "pk": 2, "fields": {"id_name": 1061280, "associated_experiments": "", "owned_instruments": "", "valid_instruments": "", "is_admin": false, "is_instrument_scientist": false}}, {"model": "autoreduce_webapp.usercache", "pk": 21, "fields": {"id_name": 1085080, "associated_experiments": "", "owned_instruments": "", "valid_instruments": "", "is_admin": false, "is_instrument_scientist": false}}, {"model": "autoreduce_webapp.experimentcache", "pk": 12, "fields": {"id_name": 1910211, "start_date": "2019-02-21 08:00:00", "end_date": "2019-02-28 09:51:02", "title": "Spin correlations and order in titanates exhibiting spin Jahn-Teller antiferromagnetism", "summary": "The spin Jahn-Teller effect stabilises 3D magnetic order in an otherwise frustrated system via magnetoelastic coupling, spontaneously at the magnetic phase transition. Examples are rare, and limited to crystals of high symmetry (e.g. spinel). We have shown that CoTi2O5, a low symmetry crystal, also exhibits spin Jahn-Teller antiferromagnetism. Here, low dimensional magnetism persists above the Neel temperature, allowing, in principle, for the 3D antiferromagnetic order to be switched on and off by applied strain  a novel material functionality of interest in the field of spintronics and oxide electronics. We propose a neutron scattering experiment to characterise the key low dimensional order, as well as determine the magnetic character of an isostructural material, FeTi2O5, which may prove to be a more promising candidate for inclusion in a spin Jahn-Teller device.", "instrument": "WISH", "pi": "Dr Roger Johnson"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 13, "fields": {"id_name": 1910054, "start_date": "2019-03-02 08:00:00", "end_date": "2019-03-04 09:52:35", "title": "Doping Effects on Electronic Phase Separation in CaFe3O5", "summary": "Our recent study of CaFe3O5 revealed a remarkable discovery of electronic phase separation, similar to examples widely reported in manganite perovskites. Electronic phase separation is known to be very sensitive to perturbations so we areinvestigating effects of substituting Fe2+ by Co2+ or Mn2+. We have succeeded in preparing CaFe3-xMxO5 (M = Co, Mn) up to x = 0.5. High resolution PND is needed to observe phase separation and magnetic peaks in x = 0.01, 0.05, 0.10, 0.25 and 0.50 samples at 10-500 K. These will initially be screened at to check whether phase segregation has occurred. More time will be devoted to phase separated samples, with unsegregrated samples collected at just a few temperatures to measure magnetostrictive changes. The results will provide key insights into the electronic phase separation of CaFe3O5.", "instrument": "WISH", "pi": "Professor Paul Attfield"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 14, "fields": {"id_name": 111, "start_date": "N/A", "end_date": "N/A", "title": "N/A", "summary": "N/A", "instrument": "", "pi": ""}}, {"model": "autoreduce_webapp.experimentcache", "pk": 15, "fields": {"id_name": 1910327, "start_date": "2019-03-20 08:30:00", "end_date": "2019-03-25 09:00:20", "title": "Effect of oxidative stress on polyunsaturated lipid bilayers modulated by cholesterol and head group composition", "summary": "The exposure of biological membranes to reactive oxygen species is key for many pathological conditions, including inflammation, infection, or sepsis. Lipid peroxidation is known to deeply affect membrane properties such as structure or stability, but the specific roles of individual cell lipid components are complex and still not well understood. Here, we aim to study the structural consequences of lipid membrane oxidation induced by photoactivated TiO2 nanoparticles, of high pharmaceutical interest, and its dependence on lipid composition by using neutron reflectometry. Polyunsaturated lipid membrane models with different cholesterol contents and head group compositions will be used to investigate the role of these key membrane components in the oxidation process, and to elucidate any potential selectivity or modulation, crucial for the cellular response towards oxidative stress.", "instrument": "POLREF", "pi": "Professor Martin Malmsten"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 17, "fields": {"id_name": 1910592, "start_date": "2019-02-25 09:00:00", "end_date": "2019-03-04 14:03:03", "title": "High resolution measurement of mode Grueneisen parameters in the negative thermal expansion material ZrW2O8", "summary": "ZrW2O8 is the classic example of a material exhibiting negative thermal expansion (NTE), i.e. lattice shrinkage on warming. The origin of this behaviour has been controversial for a long time, but is widely believed to be intimately linked to the lattice dynamics. Recent ab-inito studies have suggested that there is no single phonon mode that is responsible for the NTE, rather a collection of low energy modes all contribute. These same ab-initio studies have been used to explain the origin of negative hydration expansion (lattice shrinkage on intercalation of water) in ZrW2O8. The aim of this proposal is to verify the calculations directly using single crystal inelastic neutron scattering to measure how all of the low energy modes shift as a function of temperature, a key prediction of the theoretical work.", "instrument": "OSIRIS", "pi": "Dr Russell Ewings"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 19, "fields": {"id_name": 1820027, "start_date": "2019-02-25 08:00:00", "end_date": "2019-03-02 09:20:11", "title": "Sensing SO2 in Robust Porous MOF Materials via Simultaneous Microwave Dielectric Spectroscopy and Time-resolved Neutron Diffraction", "summary": " We seek to develop new MOFs for sensing and removal of toxic gases (e.g., SO2) and request 4 days on POLARIS to study the structural binding details and dielectric data simultaneously as SO2 is adsorbed in two stable MOFs (MFM-170·H2O and MFM-174). We will use our microwave frequency resonator sample environment and gas delivery system, which has been used successfully at POLARIS. This proposal aims to perform correlation studies that will enable the determination of the structural origins of changes in dielectric behaviour as SO2 molecules are bound within the MOF structure, insights into the mechanism of sequestration as well as offering a new opportunity for the development of ex-situ portable molecular sensors for toxic gases.", "instrument": "POLARIS", "pi": "Dr Sihai Yang"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 20, "fields": {"id_name": 1910388, "start_date": "2019-02-28 08:00:00", "end_date": "2019-03-02 10:16:44", "title": "Zr-based metal-organic frameworks as carbon-free energy carriers: a study of their structural interactions with ammonia", "summary": "Structural information of Zr-based MOFs including UiO-67, m-UiO-67, and UiO-bpydc upon ammonia loading will be investigated by an in situ neutron powder diffraction technique. Rietveld refinement will be conducted to elucidate adsorption geometries and locations of ammonia in this MOF-guest system, enabling an understanding of the exceptional ammonia uptake and the unusual adsorption behaviours of m-UiO-67 and UiO-bpydc. This work will lead to an improved ammonia storage and a more rational design for catalytic ammonia decomposition. ", "instrument": "WISH", "pi": "Professor Edman Tsang"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 22, "fields": {"id_name": 1910271, "start_date": "2019-02-25 08:00:00", "end_date": "2019-03-02 09:47:41", "title": "Extending the limits of experimental structure determination of amorphous substances -  the Ge-As-Se system", "summary": "Ge-As-Se glasses are interesting for two main reasons: they are widely used in infrared optics and optoelectronics and they serve as model materials for theories of glass formation and stability (e.g. bond constraint theory). Therefore, detailed knowledge of their short range order is important both for applications and fundamental glass science/statistical physics. The main question is whether there are strong chemical correlations in these glasses (preferred bond types, e. g. Ge-Se bonds are more likely formed than Ge-Ge and Se-Se ones) or they can be described as random networks. Recently published experimental studies do not give a clear answer to this problem. The aim of our research is to determine the short range order in these glasses by combining experimental data from state-of-the-art neutron and synchrotron facilities.", "instrument": "GEM", "pi": "Dr Pal Jovari"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 23, "fields": {"id_name": 1820026, "start_date": "2018-09-27 07:00:00", "end_date": "2018-10-10 07:49:01", "title": "Low-temperature incommensurate magnetic structure study of magneto-dielectric SrMn1-xWxO3 (X= 0.1625, 0.175) using neutron diffraction.", "summary": "The interplay between spin, charge, orbital, and lattice degrees of freedoms in  SrMn1-xWxO3 (X= 0.1625, 0.175)  produce the charge and/or spin density waves (CDW, SDW)  modulated superstructure. Such structures, involving with magnetic states, provide an appropriate base for cross-correlation effects. An Incommensurately modulated CDW structure breaks the space-inversion symmetry, which gives rise to electric polarization and makes it the suitable candidate for multiferroic studies. In this proposal, we will study in detail the incommensurate magnetic structure of  SrMn1-xWXO3 compound for x= 0.164 and 0.175  at temperatures 300K, 210K, 150K, 80K, 50K, 25K and 5K using TOF neutron scattering at GEM beam line. We need 2 days of beam time.", "instrument": "GEM", "pi": "Dr Niranjan Prasad Lalla"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 24, "fields": {"id_name": 1910380, "start_date": "2019-10-21 08:28:37", "end_date": "2019-10-28 11:18:58", "title": "T=RT, CeGeO4, D2 in argon, in situ stick, RAL4", "summary": "None", "instrument": "POLARIS", "pi": ""}}, {"model": "autoreduce_webapp.experimentcache", "pk": 26, "fields": {"id_name": 1920633, "start_date": "2019-10-22 13:32:29+01:00", "end_date": "2019-11-13 14:18:11+00:00", "title": "Deformation mechanisms in several simple alloys to underpin creep damage characterisation", "summary": "The proposal is to study three alloys, both at high temperature and room temperature, to corroborate strain results obtained through high resolution digital image correlation. The collected data will provide information on the grain scale mechanical properties which will then be used in expanding and developing creep models.", "instrument": "ENGINX", "pi": "Dr Richard Moat"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 27, "fields": {"id_name": 1920440, "start_date": "2020-02-27 08:30:00+00:00", "end_date": "2020-03-02 09:28:55+00:00", "title": "Determining the water adsorption in zirconium MOFs related to the well-known UiO-66 and UiO-67 ", "summary": "Water adsorption in porous materials is relevant for many applications such as dehumidification, thermal batteries, and delivery of drinking water in remote areas. Among them recently the development of atmospheric water harvesting devices have stood out, which aim to mitigate water scarcity in arid climates.In the quest towards an ideal performing porous material, metal-organic frameworks (MOFs) emerge as appropriate candidates. Specifically, zirconium based MOFs are among the best performing ones since they usually show permanent porosity, they are water stable and do not lose capacity after some adsorption/desorption cycles at room temperature.The analysis of the water arrangement and interaction within the porous material by means of location of physisorbed molecules is desirable for designing materials with better performance in atmospheric water harvesting applications.", "instrument": "GEM", "pi": "Dr Sonia Pérez"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 30, "fields": {"id_name": 2010457, "start_date": "2020-03-13 08:30:00+00:00", "end_date": "2020-03-15 08:30:00+00:00", "title": "The magnetic structure of perovskite like coordination polymers:  {[Cu(HCOO)2(µ-pyrimidine)]}n and {[Cu(HCOO)2NO3]H2N(CH3)2}n ", "summary": "This study is designed to identify relationships between structure and magnetic properties characteristic of coordination polymers (CPs), specifically in the model system {[Cu(HCOO)3]H2N(CH3)2}n. By determining the magnetic structure of two related CPs, in which a single magnetic pathway was systematically modified by substituting an HCOO- linker with topologically equivalent pyrimidine and NO3- ligands, respectively, we aim to address factors that tune the strength and nature of magnetic super-exchange. Moreover, the orientation of the magnetic moments and crystal-field anisotropy produced by the Jahn-Teller (JT) effect can be investigated. To achieve this goal essential information retrieved from neutron powder diffraction data measured as a function of temperature will be compared with the results of experimental charge density analysis, magnetic susceptibility, and magnetometry. ", "instrument": "WISH", "pi": "Dr Rebecca Scatena"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 36, "fields": {"id_name": 2068040, "start_date": "2020-03-14 08:30:00+00:00", "end_date": "2020-03-17 08:30:00+00:00", "title": "Investigating the role of rattlers on phonon dispersion in CoSb3 based p-type skutterudites", "summary": "Utilization and conversion of waste heat into useful electrical power is emerging as a promising source of energy. The efficiency of energy conversion, however, is low due to several factors with a thermal conductivity as one of the main factors. One of the strategies to enhance efficiency is by lowering thermal conductivity by introducing rattling atoms into materials with cage-like structures, such as skutterudites. The exact role played by these rattlers in the cage system is not clearly understood until now. In our work, we have synthesized skutterudite cage structures without and with single and double rattlers. To elucidate the role of these rattler atoms on thermal conductivity, we would like to use inelastic neutron scattering as this is ideally suited to probe the phonon density of states.", "instrument": "MARI", "pi": "Professor Satish Vitta"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 41, "fields": {"id_name": 2010759, "start_date": "2020-02-22 08:30:00+00:00", "end_date": "2020-02-25 09:44:40+00:00", "title": "The structure of LiPON and NaPON glass", "summary": "Lithium (LiPO3) and sodium (NaPO3) metaphosphate glasses show improved ionic conductivity when some of the oxygen in the phosphate tetrahedron is replaced by nitrogen. As such they are potential solid state electrolytes in battery applications. The goal of this rapid access proposal is to determine the structure of these glasses using neutron diffraction to evaluate the changes in structure that occur as nitrogen replaces oxygen. There are significant changes in the structure of these LiPON and NaPON glasses as nitrogen is added, there are apparently different types of nitrogen present and mixtures of phosphate chains and clusters and different degrees of distortion of the phosphate polyhedra, these strongly influence the dynamics of the glass and the ionic conductivity. The proposed neutron experiment will provide insight into the topology of these technologically interesting glasses. ", "instrument": "GEM", "pi": "Dr Martin Wilding"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 44, "fields": {"id_name": 0, "start_date": "N/A", "end_date": "N/A", "title": "N/A", "summary": "N/A", "instrument": "", "pi": ""}}, {"model": "autoreduce_webapp.experimentcache", "pk": 45, "fields": {"id_name": 2010263, "start_date": "2020-03-05 08:30:00+00:00", "end_date": "2020-03-09 15:24:46+00:00", "title": "Local structure of a barocaloric framework material", "summary": "Barocaloric materials, in which a large isothermal entropy change is associated with a pressure-induced phase transition, offer an alternative to vapour-compression techniques that rely on refrigerants that contribute to global warming and ozone depletion. The framework material TPrAMn(dca)3 has recently been shown to have a giant barocaloric effect, due to an order-disorder phase transition involving both the dca and TPrA ions. Crystallographic disorder of both ions in both the low- and high-symmetry phases makes structural characterisation extremely challenging, yet it is precisely this disorder that accounts for the material’s behaviour. The aim of this proposal is to achieve a quantitative understanding of this disorder by collecting high-resolution pair distribution functions from total scattering. This will complete the picture of the material’s local structure for the first time.", "instrument": "GEM", "pi": "Dr Anthony Phillips"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 46, "fields": {"id_name": 1920066, "start_date": "2020-02-17 08:30:00+00:00", "end_date": "2020-02-19 10:45:37+00:00", "title": "Determining the Crystal and Magnetic Structures of [Li(oxalate)]2[Co5(OH)8]", "summary": "Dense corrdination frameworks that contain inorganic centres connected into extended lattices by polyatomic anions often adopt highly anisotropic structures. Thus they often have strong magnetic interactions in only one or two dimensions and, in the latter case, can also be designed so they have strongly competing interaction that give rise to magnetic frustration. Recently discovered [Li(oxalate)]2[Co5(OH)8] appears likely to be one such two dimensional magnet. We will determine the structure of its antiferromagnetic state, which emerges around 50 K, as well as probing for any further transitions at lower temperature and indications of magnetic frustration. We will also determine the positions adopted by deuteriums in its structure, as required to confirm its chemical composition. We will use GEM diffractometer to do its ability to collect high quality data over a wide range of d-space.", "instrument": "GEM", "pi": "Dr Paul Saines"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 47, "fields": {"id_name": 2010163, "start_date": "2020-03-03 08:30:00+00:00", "end_date": "2020-03-11 08:22:23+00:00", "title": "Bulk Texture Analysis of Hot Forged β Titanium alloy", "summary": "High strength to density ratio, excellent hardenability, hot deformability and better fatigue properties are the main attractive characteristics of β-Titanium alloys. The phase transformations and variations in the associated properties in β-Ti alloys made them to be attractive materials for making structural components for the aerospace industry. Titanium alloys developed for making critical components like landing gears by the hot forging route. The β grains, which are harder as compared to globular α phases, going to contribute for strength of this alloy at RT. The globular α phase formed in the β matrix promotes the ductility of the material. The knowledge of texture is essential in understanding hot workability of the alloy as well as to achieve desirable mechanical properties of final components manufactured.", "instrument": "GEM", "pi": "Dr Giribaskar Sivaswamy"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 48, "fields": {"id_name": 1920072, "start_date": "2019-12-16 08:30:00+00:00", "end_date": "2020-02-12 10:22:54+00:00", "title": "Magnetic order in the first hybrid layered fluoroperovskites", "summary": "Layered perovskites are well known functional materials but, in the context of fluoride chemistry, have so far been restricted to purely inorganic examples: K2NiF4 is the classic example. On the contrary, hybrid perovskites (i.e. those containing organic moieties between inorganic layers) are currently revolutionising the field of solar cells materials, with the development of hybrid layered lead iodides. There are no fluoride-containing examples. We have recently prepared the first examples of a family of layered perovskite fluorides incorporating organic inter-layer species. We expect these compounds to be of interest  for their magnetic properties, rather than optical-based properties. Here we aim to study the magnetic ordering in the first examples of this new family. In particular, we'll look at a new hybrid cobalt fluoride, which shows a large, reversible magnetisation below ~ 80 K", "instrument": "GEM", "pi": "Professor Phil Lightfoot"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 50, "fields": {"id_name": 1920687, "start_date": "2020-02-13 08:30:00+00:00", "end_date": "2020-02-14 09:01:13+00:00", "title": "Measuring the spin-wave spectrum of the room temperature metal-organic spintronic material V[TCNE]2", "summary": "Organic-based materials have found applications in a wide variety of devices, including light emitting diodes, photovoltaics, and field effect transistors. These take advantage of the low cost, chemical tunability, and mechanical flexibility of this class of materials. Vanadium tetracyanoethylene (V[TCNE]x~2) exhibits ferimagnetic order well above room temperature  (TN > 600K), and an ultra-narrow ferromagnetic resonance (FMR) linewidth , making it a competetive alternative to best-in-class inorganic materials. Despite its popularity, little is known about the microscopic nature of the magnetism in this material. Here, we propose to measure magnetic excitations on a solvothermally produced powder sample of V[TCNE] x~2, in order to obtain as much information as possible about the excitation in this material as is presently achievable with neutrons given sample limitations. ", "instrument": "MAPS", "pi": "Dr Andrew Princep"}}, {"model": "autoreduce_webapp.experimentcache", "pk": 53, "fields": {"id_name": 2010678, "start_date": "2020-03-19 08:30:00+00:00", "end_date": "2020-03-21 08:30:00+00:00", "title": "Crystal field excitations in the defect-fluorite Dy2Zr2O7 and Ho2Zr2O7", "summary": "The low energy physics in rare-earth oxides is largely determined by the single ion properties of the magnetic atom. We propose to measure the crystalline electric field (CEF) properties of the most common by-product of pyrochlores. Defect-fluorite is the generic name given to 2-2-7 stoichiometry compounds that, for different reasons, do not form in the Fd-3m space group. Because of their close relationship in titanate pyrochlores (spin ices), we chose here to investigate the CEF of Dy2Zr2O7 and Ho2Zr2O7. The former was recently shown to present spin dynamics down to 500 mK, in stark contrast with the canonical spin ice Dy2Ti2O7. Given that the tetrahedra arrangement and rare-earth distances in deferct-fluorites are, relative to pyrochlores, basically unaltered, the reason for this behaviour is connected with single ion magnetism. This is the basic motivation of this proposal.    ", "instrument": "MARI", "pi": "Dr Viviane Pecanha Antonio"}}, {"model": "reduction_viewer.instrument", "pk": 1, "fields": {"name": "GEM", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 2, "fields": {"name": "WISH", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 3, "fields": {"name": "OSIRIS", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 4, "fields": {"name": "POLARIS", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 5, "fields": {"name": "MUSR", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 6, "fields": {"name": "POLREF", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 7, "fields": {"name": "ENGINX", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 8, "fields": {"name": "MARI", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 9, "fields": {"name": "HRPD", "is_active": true, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 10, "fields": {"name": "MAPS", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 11, "fields": {"name": "MERLIN", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.instrument", "pk": 12, "fields": {"name": "LARMOR", "is_active": false, "is_paused": false}}, {"model": "reduction_viewer.experiment", "pk": 759, "fields": {"reference_number": 1920009}}, {"model": "reduction_viewer.status", "pk": 1, "fields": {"value": "e"}}, {"model": "reduction_viewer.status", "pk": 2, "fields": {"value": "q"}}, {"model": "reduction_viewer.status", "pk": 3, "fields": {"value": "p"}}, {"model": "reduction_viewer.status", "pk": 4, "fields": {"value": "c"}}, {"model": "reduction_viewer.status", "pk": 5, "fields": {"value": "s"}}, {"model": "reduction_viewer.software", "pk": 1, "fields": {"name": "Mantid", "version": "4.2.20200115.1546"}}, {"model": "reduction_viewer.reductionrun", "pk": 64042, "fields": {"run_number": 78938, "run_version": 0, "started_by": -1, "run_name": "", "admin_log": "Reduction: started\n_new_reduction_data_path argument: /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938\nFinal Result Directory = /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/\nFinal log directory: /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/reduction_log/\npath /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938 does not exist. \n Attempting to make path.\npath /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/reduction_log/ does not exist. \n Attempting to make path.\npath /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/ does not exist. \n Attempting to make path.\npath /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/reduction_log/ does not exist. \n Attempting to make path.\nSuccessful write access to /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938\nSuccessful write access to /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/reduction_log/\nSuccessful write access to /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/\nSuccessful write access to /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/reduction_log/\nSuccessful read access to /isis/NDXHRPD/Instrument/data/cycle_19_4/HRP78938.nxs\n----------------\nReduction script: import numpy  # Required due to Mantid4.0 import i ...\nResult dir: /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938\nLog dir: /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/reduction_log/\nOut log: /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/reduction_log/RB_1920009_Run_78938_Script.out\nDatafile: /isis/NDXHRPD/Instrument/data/cycle_19_4/HRP78938.nxs\n----------------\nReduction subprocess started.\n/autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938\nMoving /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938 to /instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/\nRemove temp dir /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938\n", "graph": null, "message": null, "reduction_log": "Running validation\nValidation successful\n<module 'reduce_vars' from '/isis/NDXHRPD/user/scripts/autoreduction/reduce_vars.py'>\ninput_file = /isis/NDXHRPD/Instrument/data/cycle_19_4/HRP78938.nxs\noutput_dir = /autoreducetmp/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938\n", "script": "import numpy  # Required due to Mantid4.0 import issue \nimport sys\nimport os\nimport shutil\nfrom isis_powder import HRPD\nsys.path.append(\"/isis/NDXHRPD/user/scripts/autoreduction\") \nimport reduce_vars as web_var\n\ndef validate(file, dir):\n    \"\"\"\n    Function that validates if a file and/or directory exist. If not a \n    RunTimeError is raised which is picked up by Autoreduction.\n\n    :param file: full path of data file. Provide empty string to ignore\n    :type file: str\n    :param dir: full path of a directory. Provide empty string to ignore\n    :type dir: str   \n    \"\"\"\n    print(\"Running validation\")\n    if file:\n        if not os.path.isfile(file):\n            raise RuntimeError(\"Unable to find file: {}\".format(file))\n    if dir:\n        if not os.path.isdir(dir):\n            raise RuntimeError(\"Unable to find directory: {}\".format(dir))\n    print(\"Validation successful\")\n        \n\ndef main(input_file, output_dir):\n    \"\"\"\n    Method called by Autoreduction to a reduction job.\n\n    :param input_file: full path of raw data file\n    :type input_file: str\n    :param output_dir: directory where reduced data will be stored and a\n        location which user can access\n    :type output_dir: str\n    \"\"\"\n    validate(input_file, output_dir)\n\n    # Example of printing some stuff which is captured in autoreduction\n    # output log file\n    print(web_var)\n    print(\"input_file = \" + str(input_file))\n    print(\"output_dir = \" + str(output_dir))\n\n    # Copy raw data to output dir.\n    # Note this should only be done if raw files are small and for specific\n    # purpose such as testing\n    shutil.copy(input_file, output_dir)\n\n    # And of course, here and below insert your reduction code!\n\nif __name__ == \"__main__\":\n    main(\"some input file\", \"some output dir\")", "created": "2020-09-27T10:49:34Z", "finished": "2020-09-27T09:49:40Z", "last_updated": "2020-09-27T10:49:40Z", "retry_when": null, "started": "2020-09-27T09:49:36Z", "cancel": false, "hidden_in_failviewer": false, "overwrite": true, "experiment": 759, "instrument": 9, "retry_run": null, "status": 4, "software": null}}, {"model": "reduction_viewer.datalocation", "pk": 64021, "fields": {"file_path": "\\\\isis\\inst$\\NDXHRPD\\Instrument\\data\\cycle_19_4\\HRP78938.nxs", "reduction_run": 64042}}, {"model": "reduction_viewer.reductionlocation", "pk": 30541, "fields": {"file_path": "/instrument/HRPD/RBNumber/RB1920009/autoreduced/78938/4/", "reduction_run": 64042}}, {"model": "reduction_variables.variable", "pk": 1744753, "fields": {"name": "do_absorb_corrections", "value": "False", "type": "boolean", "is_advanced": false, "help_text": "Do you want absorb corrections on?"}}, {"model": "reduction_variables.variable", "pk": 1744754, "fields": {"name": "vanadium_normalisation", "value": "True", "type": "boolean", "is_advanced": false, "help_text": "Do you want vanadium normalisation on?"}}, {"model": "reduction_variables.variable", "pk": 1744755, "fields": {"name": "mode", "value": "coupled", "type": "text", "is_advanced": false, "help_text": "The mode, probably PDF"}}, {"model": "reduction_variables.variable", "pk": 1744756, "fields": {"name": "multiple_scattering", "value": "False", "type": "boolean", "is_advanced": false, "help_text": "Do you want multiple scattering on?"}}, {"model": "reduction_variables.variable", "pk": 1744757, "fields": {"name": "window", "value": "30-130", "type": "text", "is_advanced": false, "help_text": ""}}, {"model": "reduction_variables.variable", "pk": 1744758, "fields": {"name": "do_absorb_corrections", "value": "False", "type": "boolean", "is_advanced": false, "help_text": "Do you want absorb corrections on?"}}, {"model": "reduction_variables.variable", "pk": 1744759, "fields": {"name": "vanadium_normalisation", "value": "True", "type": "boolean", "is_advanced": false, "help_text": "Do you want vanadium normalisation on?"}}, {"model": "reduction_variables.variable", "pk": 1744760, "fields": {"name": "mode", "value": "coupled", "type": "text", "is_advanced": false, "help_text": "The mode, probably PDF"}}, {"model": "reduction_variables.variable", "pk": 1744761, "fields": {"name": "multiple_scattering", "value": "False", "type": "boolean", "is_advanced": false, "help_text": "Do you want multiple scattering on?"}}, {"model": "reduction_variables.variable", "pk": 1744762, "fields": {"name": "window", "value": "30-130", "type": "text", "is_advanced": false, "help_text": ""}}, {"model": "reduction_variables.instrumentvariable", "pk": 1744753, "fields": {"instrument": 9, "experiment_reference": null, "start_run": 0, "tracks_script": true}}, {"model": "reduction_variables.instrumentvariable", "pk": 1744754, "fields": {"instrument": 9, "experiment_reference": null, "start_run": 0, "tracks_script": true}}, {"model": "reduction_variables.instrumentvariable", "pk": 1744755, "fields": {"instrument": 9, "experiment_reference": null, "start_run": 0, "tracks_script": true}}, {"model": "reduction_variables.instrumentvariable", "pk": 1744756, "fields": {"instrument": 9, "experiment_reference": null, "start_run": 0, "tracks_script": true}}, {"model": "reduction_variables.instrumentvariable", "pk": 1744757, "fields": {"instrument": 9, "experiment_reference": null, "start_run": 0, "tracks_script": true}}, {"model": "reduction_variables.runvariable", "pk": 1744758, "fields": {"reduction_run": 64042}}, {"model": "reduction_variables.runvariable", "pk": 1744759, "fields": {"reduction_run": 64042}}, {"model": "reduction_variables.runvariable", "pk": 1744760, "fields": {"reduction_run": 64042}}, {"model": "reduction_variables.runvariable", "pk": 1744761, "fields": {"reduction_run": 64042}}, {"model": "reduction_variables.runvariable", "pk": 1744762, "fields": {"reduction_run": 64042}}]